docs: :memo: Melhorado diagrama com mermaid
